aloeJun/STM32F103ZET6/02key/user/api/delay.h
#ifndef __DELAY_H
#define __DELAY_H

#include "stm32f10x.h"

//ø’”Ôæ‰   72MHZ  72000  72
#define delay_1us()	{\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();\
__NOP();__NOP();\
}

extern uint32_t LedTime;
extern uint32_t KeyTime;


void Delay_us(uint32_t time);
void Delay_ms(uint32_t time);
void Delay_nus(unsigned int t);
void Delay_nms(unsigned int t);

#endif


